andersenthomas98/masteroppgave/nrf5sdk_thread/components/libraries/cli/nrf_cli.c
    /* create argument list */
    quote = make_argv(&argc,
                      &argv[0],
                      p_cli->p_ctx->cmd_buff,
                      NRF_CLI_ARGC_MAX);

    if (!argc)
    {
        cursor_next_line_move(p_cli);
        return;
    }

    if (quote != 0)
    {
        nrf_cli_error(p_cli, "not terminated: %c", quote);
        return;
    }

    /*  Searching for a matching root command. */
    for (cmd_idx = 0; cmd_idx <= CLI_DATA_SECTION_ITEM_COUNT; ++cmd_idx)
    {
        if (cmd_idx >= CLI_DATA_SECTION_ITEM_COUNT)
        {
            nrf_cli_error(p_cli, "%s%s", argv[0], NRF_CLI_MSG_COMMAND_NOT_FOUND);
            return;
        }

        p_cmd = CLI_DATA_SECTION_ITEM_GET(cmd_idx);
        if (strcmp(argv[cmd_lvl], p_cmd->u.p_static->p_syntax) != 0)
        {
            continue;
        }
        break;
    }

    /* Root command shall be always static. */
    ASSERT(p_cmd->is_dynamic == false);

    /* Memory reserved for dynamic commands. */
    nrf_cli_static_entry_t static_entry;
    nrf_cli_static_entry_t const * p_static_entry = NULL;

    memset(&p_cli->p_ctx->active_cmd, 0, sizeof(p_cli->p_ctx->active_cmd));
    if (p_cmd->u.p_static->handler != NULL)
    {
        p_cli->p_ctx->active_cmd = *p_cmd->u.p_static;
    }

    p_cmd = p_cmd->u.p_static->p_subcmd;
    cmd_lvl++;
    cmd_idx = 0;

    while (1)
    {
        if (cmd_lvl >= argc)
        {
            break;
        }

        if (!strcmp(argv[cmd_lvl], "-h") || !strcmp(argv[cmd_lvl], "--help"))
        {
            /* Command called with help option so it makes no sense to search deeper commands. */
            cli_flag_help_set(p_cli);
            break;
        }

#if NRF_MODULE_ENABLED(NRF_CLI_WILDCARD)
        /* Wildcard character is found */
        if (wildcard_character_exist(argv[cmd_lvl]))
        {
            size_t counter = 0;
            wildcard_cmd_status_t status;

            /* Function will search commands tree for commands matching wildcard pattern stored in
               argv[cmd_lvl]. If match is found wildcard pattern will be replaced by matching
               commands in temp_buffer. If there is no space to add all matching commands function
               will add as many as possible. Next it will continue to search for next wildcard
               pattern and it will try to add matching commands. */
            status = commands_expand(p_cli, p_cmd, cmd_lvl, argv[cmd_lvl], &counter);
            if (WILDCARD_CMD_NO_MATCH_FOUND == status)
            {
                break;
            }
            commands_expanded += counter;
            cmd_lvl++;
            continue;
        }
#endif

        cmd_get(p_cmd,
                cmd_lvl,
                cmd_idx++,
                &p_static_entry,
                &static_entry);

        if ((cmd_idx == 0) || (p_static_entry == NULL))
        {
            break;
        }

        if (strcmp(argv[cmd_lvl], p_static_entry->p_syntax) == 0)
        {
            /* checking if command has a handler */
            if (p_static_entry->handler != NULL)
            {
#if NRF_MODULE_ENABLED(NRF_CLI_WILDCARD)
                if (commands_expanded > 0)
                {
                    cursor_end_position_move(p_cli);
                    if (!cursor_in_empty_line(p_cli))
                    {
                        cursor_next_line_move(p_cli);
                    }
                    /* An error occured, fnmatch argument cannot be followed by argument
                    * with a handler to avoid multiple function calls. */
                    nrf_cli_error(p_cli, "Error: requested multiple function executions");
                    cli_flag_help_clear(p_cli);
                    return;
                }
#endif
                /* Storing p_st_cmd->handler is not feasible for dynamic commands. Data will be
                 * invalid with the next loop iteration. */
                cmd_handler_lvl = cmd_lvl;
                p_cli->p_ctx->active_cmd = *p_static_entry;
            }

            cmd_lvl++;
            cmd_idx = 0;
            p_cmd = p_static_entry->p_subcmd;
        }
    }
#if NRF_MODULE_ENABLED(NRF_CLI_WILDCARD)
    if (commands_expanded > 0)
    {
        /* Copy temp_buff to cmd_buff */
        memcpy(p_cli->p_ctx->cmd_buff,
               p_cli->p_ctx->temp_buff,
               p_cli->p_ctx->cmd_tmp_buff_len);
        p_cli->p_ctx->cmd_buff_len = p_cli->p_ctx->cmd_tmp_buff_len;

        /* calling make_arg function again because cmd_buffer has additional commads */
        (void)make_argv(&argc,
                        &argv[0],
                        p_cli->p_ctx->cmd_buff,
                        NRF_CLI_ARGC_MAX);
    }
 #endif

    if (p_cli->p_ctx->active_cmd.handler != NULL)
    {
        p_cli->p_ctx->active_cmd.handler(p_cli,
                                         argc - cmd_handler_lvl,
                                         &argv[cmd_handler_lvl]);
    }
    else
    {
        nrf_cli_error(p_cli, NRF_CLI_MSG_SPECIFY_SUBCOMMAND);
    }
    cli_flag_help_clear(p_cli);
}

/* Function required by qsort. */
static int string_cmp(void const * pp_a, void const * pp_b)
{
    ASSERT(pp_a);
    ASSERT(pp_b);

    char const ** pp_str_a = (char const **)pp_a;
    char const ** pp_str_b = (char const **)pp_b;

    return strcmp(*pp_str_a, *pp_str_b);
}

static void cli_transport_evt_handler(nrf_cli_transport_evt_t evt_type, void * p_context)
{
    nrf_cli_t * p_cli = (nrf_cli_t *)p_context;
    ASSERT(p_cli);
#if NRF_MODULE_ENABLED(NRF_CLI_USES_TASK_MANAGER)
    task_events_set(p_cli->p_ctx->task_id, evt_type == NRF_CLI_TRANSPORT_EVT_RX_RDY ?
            NRF_CLI_TRANSPORT_RX_RDY_TASK_EVT : NRF_CLI_TRANSPORT_TX_RDY_TASK_EVT);
#else

    if (evt_type == NRF_CLI_TRANSPORT_EVT_RX_RDY)
    {

    }
    else
    {
        /* wr done evt */
        p_cli->p_ctx->internal.flag.tx_rdy = 1;
    }
#endif
}

static ret_code_t nrf_cli_instance_init(nrf_cli_t const * p_cli,
                                        void const *      p_config,
                                        bool              use_colors)
{
    ASSERT(p_cli);
    ASSERT(p_cli->p_ctx && p_cli->p_iface && p_cli->p_name);

#if defined(NRF_CLI_LOG_BACKEND) && NRF_CLI_LOG_BACKEND
    ((nrf_cli_log_backend_t *)p_cli->p_log_backend->p_ctx)->p_cli = p_cli;
#endif
    ret_code_t ret = p_cli->p_iface->p_api->init(p_cli->p_iface,
                                                 p_config,
                                                 cli_transport_evt_handler,
                                                 (void *)p_cli);
    if (ret != NRF_SUCCESS)
    {
        return ret;
    }

#if NRF_MODULE_ENABLED(NRF_CLI_HISTORY)
    ASSERT(p_cli->p_cmd_hist_mempool);
    ret = nrf_memobj_pool_init(p_cli->p_cmd_hist_mempool);
    if (ret != NRF_SUCCESS)
    {
        return ret;
    }
    p_cli->p_ctx->p_cmd_list_head = NULL;
    p_cli->p_ctx->p_cmd_list_tail = NULL;
#endif

    memset(p_cli->p_ctx, 0, sizeof(nrf_cli_ctx_t));
    p_cli->p_ctx->internal.flag.tx_rdy = 1;

#if NRF_MODULE_ENABLED(NRF_CLI_VT100_COLORS)
    p_cli->p_ctx->internal.flag.use_colors = use_colors;
#endif
    p_cli->p_ctx->internal.flag.echo = NRF_CLI_ECHO_STATUS;
    p_cli->p_ctx->state = NRF_CLI_STATE_INITIALIZED;
    p_cli->p_ctx->vt100_ctx.cons.terminal_wid = NRF_CLI_DEFAULT_TERMINAL_WIDTH;
    p_cli->p_ctx->vt100_ctx.cons.terminal_hei = NRF_CLI_DEFAULT_TERMINAL_HEIGHT;

